<template>
  <el-card class="home__card">
    <div class="home__card-title">首页</div>
    <el-row>
      <el-col :span="12">
        <div class="home__card-mini-title">
          <span style="font-weight: 700"> 签到记录 </span>
          <div style="margin-left: 30px">
            <el-button type="text" @click="inde"> 上月 </el-button>
            <span style="display: inline-block; margin: 0 10px"
              >{{ mouth }}月</span
            >
            <el-button type="text" @click="decr"> 下月 </el-button>
          </div>
        </div>
        <v-chart :option="option" style="height: 560px"></v-chart>
      </el-col>
      <el-col :span="12">
        <el-row>
          <el-col :span="12">
            <el-card class="home__card-mini-ctx">
              <div class="home__card-icon-container">
                <el-icon color="#40c9c6"><Document /></el-icon>
              </div>
              <div class="home__card-desc">
                <div class="home__card-mini-title">总工作数量</div>
                <div class="home__card-mini-count">{{ workNum }}</div>
              </div>
            </el-card>
          </el-col>
          <el-col :span="12">
            <el-card class="home__card-mini-ctx">
              <div class="home__card-icon-container">
                <el-icon color="#40c9c6"><DocumentChecked /></el-icon>
              </div>
              <div class="home__card-desc">
                <div class="home__card-mini-title">已完成工作数量</div>
                <div class="home__card-mini-count">{{ doneWorkNum }}</div>
              </div>
            </el-card>
          </el-col>
        </el-row>
        <el-row>
          <el-col :span="12">
            <el-card class="home__card-mini-ctx">
              <div class="home__card-icon-container">
                <el-icon color="#40c9c6"><DocumentDelete /></el-icon>
              </div>
              <div class="home__card-desc">
                <div class="home__card-mini-title">未完成工作数量</div>
                <div class="home__card-mini-count">{{ unDoneWorkNum }}</div>
              </div>
            </el-card>
          </el-col>
          <el-col :span="12">
            <el-card class="home__card-mini-ctx">
              <div class="home__card-icon-container">
                <el-icon color="#40c9c6"><User /></el-icon>
              </div>
              <div class="home__card-desc">
                <div class="home__card-mini-title">负责老人数量</div>
                <div class="home__card-mini-count">{{ olderCount }}</div>
              </div>
            </el-card>
          </el-col>
        </el-row>

        <el-row>
          <el-col :span="24">
            <el-card style="margin-top: 20px">
              <div class="e-title">护理项目分类统计</div>
              <div style="height: 200px">
                <v-chart :option="category" v-loading="loading" />
              </div>
            </el-card>
          </el-col>
        </el-row>
      </el-col>
    </el-row>
  </el-card>
</template>

<script setup>
import axios from "axios";
import { ref, onMounted, watch } from "vue";
import { useStore } from "vuex";
import * as echarts from "echarts";
import {
  User,
  Document,
  DocumentChecked,
  DocumentDelete,
} from "@element-plus/icons-vue";
let store = useStore();
onMounted(() => {
  initCareList();
});

let workNum = ref(0);
let olderCount = ref(0);
let doneWorkNum = ref(0);
let unDoneWorkNum = ref(0);

let initCareList = () => {
  axios
    .get("/caregiverDataPanel", {
      params: {
        caregiverId: store.state.userInfo.userId,
      },
    })
    .then((res) => {
      res.data.data.clockData;
      let data = [];
      dateList.forEach((item) => {
        let arr1 = item[0].split("-");
        let flag = res.data.data.clockData.find((val) => {
          let arr2 = val.time.split("-");
          return (
            parseInt(arr1[0]) == parseInt(arr2[0]) &&
            parseInt(arr1[1]) == parseInt(arr2[1]) &&
            parseInt(arr1[2]) == parseInt(arr2[2])
          );
        });
        if (flag) {
          data.push([item[0], "", item[1], "已签"]);
        } else {
          data.push([item[0], "", item[1], item[2]]);
        }
      });
      option.value.series[0].data = data;
      option.value.series[1].data = data;

      res.data.data.catagoryCountDTOList.forEach((item) => {
        category.value.series[0].data.push({
          value: item.count,
          name: item.name,
        });
        category.value.legend.data.push(item.name);
      });

      workNum.value = res.data.data.workNum;
      olderCount.value = res.data.data.olderCount;
      doneWorkNum.value = res.data.data.doneWorkNum;
      unDoneWorkNum.value = res.data.data.unDoneWorkNum;
    });
};

let year = ref("2022");
let mouth = ref(new Date().getMonth() + 1);
let inde = () => {
  if (mouth.value - 1 == 0) {
    year.value = +year.value - 1;
    mouth.value = 12;
  } else {
    mouth.value--;
  }
};
let decr = () => {
  if (mouth.value + 1 == 13) {
    year.value = +year.value + 1;
    mouth.value = 1;
  } else {
    mouth.value++;
  }
};
watch(
  () => mouth.value,
  (cur) => {
    option.value.calendar[0].range = year.value + "-" + mouth.value;
  }
);
let option = ref({
  tooltip: {},
  calendar: [
    {
      left: "center",
      top: "middle",
      cellSize: [70, 70],
      yearLabel: { show: false },
      orient: "vertical",
      dayLabel: {
        firstDay: 1,
        nameMap: "cn",
      },
      monthLabel: {
        show: false,
      },
      range: year.value + "-" + mouth.value,
    },
  ],
  series: [
    {
      type: "scatter",
      coordinateSystem: "calendar",
      symbolSize: 1,
      label: {
        show: true,
        formatter: function (params) {
          var d = echarts.number.parseDate(params.value[0]);
          return d.getDate() + "\n\n" + params.value[2] + "\n\n";
        },
        color: "#000",
      },
      data: [],
    },
    {
      type: "scatter",
      coordinateSystem: "calendar",
      symbolSize: 1,
      label: {
        show: true,
        formatter: function (params) {
          return "\n\n\n" + (params.value[3] || "");
        },
        fontSize: 14,
        fontWeight: 700,
        color: "#a00",
      },
      data: [],
    },
  ],
});

let category = ref({
  color: ["#7EC0EE", "#FF9F7F", "#FFD700", "#C9C9C9", "#E066FF", "#C0FF3E"],
  legend: {
    data: [],
    bottom: "bottom",
  },
  tooltip: {
    trigger: "item",
  },
  series: [
    {
      name: "护理项目",
      type: "pie",
      roseType: "radius",
      data: [],
    },
  ],
});

const dateList = [
  ["2022-1-1", "初四"],
  ["2022-1-2", "初五"],
  ["2022-1-3", "初六"],
  ["2022-1-4", "初七"],
  ["2022-1-5", "初八"],
  ["2022-1-6", "初九"],
  ["2022-1-7", "初十"],
  ["2022-1-8", "十一"],
  ["2022-1-9", "十二"],
  ["2022-1-10", "十三"],
  ["2022-1-11", "十四"],
  ["2022-1-12", "十五"],
  ["2022-1-13", "十六"],
  ["2022-1-14", "十七"],
  ["2022-1-15", "十八"],
  ["2022-1-16", "十九"],
  ["2022-1-17", "二十"],
  ["2022-1-18", "廿一"],
  ["2022-1-19", "廿二"],
  ["2022-1-20", "廿三"],
  ["2022-1-21", "廿四"],
  ["2022-1-22", "廿五"],
  ["2022-1-23", "廿六"],
  ["2022-1-24", "廿七"],
  ["2022-1-25", "廿八"],
  ["2022-1-26", "廿九"],
  ["2022-1-27", "三十"],
  ["2022-1-28", "正月"],
  ["2022-1-29", "初二"],
  ["2022-1-30", "初三"],
  ["2022-1-31", "初四"],
  ["2022-2-1", "初五"],
  ["2022-2-2", "初六"],
  ["2022-2-3", "初七"],
  ["2022-2-4", "初八"],
  ["2022-2-5", "初九"],
  ["2022-2-6", "初十"],
  ["2022-2-7", "十一"],
  ["2022-2-8", "十二"],
  ["2022-2-9", "十三"],
  ["2022-2-10", "十四"],
  ["2022-2-11", "十五"],
  ["2022-2-12", "十六"],
  ["2022-2-13", "十七"],
  ["2022-2-14", "十八"],
  ["2022-2-15", "十九"],
  ["2022-2-16", "二十"],
  ["2022-2-17", "廿一"],
  ["2022-2-18", "廿二"],
  ["2022-2-19", "廿三"],
  ["2022-2-20", "廿四"],
  ["2022-2-21", "廿五"],
  ["2022-2-22", "廿六"],
  ["2022-2-23", "廿七"],
  ["2022-2-24", "廿八"],
  ["2022-2-25", "廿九"],
  ["2022-2-26", "二月"],
  ["2022-2-27", "初二"],
  ["2022-2-28", "初三"],
  ["2022-3-1", "初四"],
  ["2022-3-2", "初五"],
  ["2022-3-3", "初六"],
  ["2022-3-4", "初七"],
  ["2022-3-5", "初八"],
  ["2022-3-6", "初九"],
  ["2022-3-7", "初十"],
  ["2022-3-8", "十一"],
  ["2022-3-9", "十二"],
  ["2022-3-10", "十三"],
  ["2022-3-11", "十四"],
  ["2022-3-12", "十五"],
  ["2022-3-13", "十六"],
  ["2022-3-14", "十七"],
  ["2022-3-15", "十八"],
  ["2022-3-16", "十九"],
  ["2022-3-17", "二十"],
  ["2022-3-18", "廿一"],
  ["2022-3-19", "廿二"],
  ["2022-3-20", "廿三"],
  ["2022-3-21", "廿四"],
  ["2022-3-22", "廿五"],
  ["2022-3-23", "廿六"],
  ["2022-3-24", "廿七"],
  ["2022-3-25", "廿八"],
  ["2022-3-26", "廿九"],
  ["2022-3-27", "三十"],
  ["2022-3-28", "三月"],
  ["2022-3-29", "初二"],
  ["2022-3-30", "初三"],
  ["2022-3-31", "初四"],
  ["2022-4-1", "初五"],
  ["2022-4-2", "初六"],
  ["2022-4-3", "初七"],
  ["2022-4-4", "初八"],
  ["2022-4-5", "初九"],
  ["2022-4-6", "初十"],
  ["2022-4-7", "十一"],
  ["2022-4-8", "十二"],
  ["2022-4-9", "十三"],
  ["2022-4-10", "十四"],
  ["2022-4-11", "十五"],
  ["2022-4-12", "十六"],
  ["2022-4-13", "十七"],
  ["2022-4-14", "十八"],
  ["2022-4-15", "十九"],
  ["2022-4-16", "二十"],
  ["2022-4-17", "廿一"],
  ["2022-4-18", "廿二"],
  ["2022-4-19", "廿三"],
  ["2022-4-20", "廿四"],
  ["2022-4-21", "廿五"],
  ["2022-4-22", "廿六"],
  ["2022-4-23", "廿七"],
  ["2022-4-24", "廿八"],
  ["2022-4-25", "廿九"],
  ["2022-4-26", "四月"],
  ["2022-4-27", "初二"],
  ["2022-4-28", "初三"],
  ["2022-4-29", "初四"],
  ["2022-4-30", "初五"],
  ["2022-5-1", "初六"],
  ["2022-5-2", "初七"],
  ["2022-5-3", "初八"],
  ["2022-5-4", "初九"],
  ["2022-5-5", "初十"],
  ["2022-5-6", "十一"],
  ["2022-5-7", "十二"],
  ["2022-5-8", "十三"],
  ["2022-5-9", "十四"],
  ["2022-5-10", "十五"],
  ["2022-5-11", "十六"],
  ["2022-5-12", "十七"],
  ["2022-5-13", "十八"],
  ["2022-5-14", "十九"],
  ["2022-5-15", "二十"],
  ["2022-5-16", "廿一"],
  ["2022-5-17", "廿二"],
  ["2022-5-18", "廿三"],
  ["2022-5-19", "廿四"],
  ["2022-5-20", "廿五"],
  ["2022-5-21", "廿六"],
  ["2022-5-22", "廿七"],
  ["2022-5-23", "廿八"],
  ["2022-5-24", "廿九"],
  ["2022-5-25", "三十"],
  ["2022-5-26", "五月"],
  ["2022-5-27", "初二"],
  ["2022-5-28", "初三"],
  ["2022-5-29", "初四"],
  ["2022-5-30", "初五"],
  ["2022-5-31", "初六"],
  ["2022-6-1", "初七"],
  ["2022-6-2", "初八"],
  ["2022-6-3", "初九"],
  ["2022-6-4", "初十"],
  ["2022-6-5", "十一"],
  ["2022-6-6", "十二"],
  ["2022-6-7", "十三"],
  ["2022-6-8", "十四"],
  ["2022-6-9", "十五"],
  ["2022-6-10", "十六"],
  ["2022-6-11", "十七"],
  ["2022-6-12", "十八"],
  ["2022-6-13", "十九"],
  ["2022-6-14", "二十"],
  ["2022-6-15", "廿一"],
  ["2022-6-16", "廿二"],
  ["2022-6-17", "廿三"],
  ["2022-6-18", "廿四"],
  ["2022-6-19", "廿五"],
  ["2022-6-20", "廿六"],
  ["2022-6-21", "廿七"],
  ["2022-6-22", "廿八"],
  ["2022-6-23", "廿九"],
  ["2022-6-24", "六月"],
  ["2022-6-25", "初二"],
  ["2022-6-26", "初三"],
  ["2022-6-27", "初四"],
  ["2022-6-28", "初五"],
  ["2022-6-29", "初六"],
  ["2022-6-30", "初七"],
  ["2022-7-1", "初八"],
  ["2022-7-2", "初九"],
  ["2022-7-3", "初十"],
  ["2022-7-4", "十一"],
  ["2022-7-5", "十二"],
  ["2022-7-6", "十三"],
  ["2022-7-7", "十四"],
  ["2022-7-8", "十五"],
  ["2022-7-9", "十六"],
  ["2022-7-10", "十七"],
  ["2022-7-11", "十八"],
  ["2022-7-12", "十九"],
  ["2022-7-13", "二十"],
  ["2022-7-14", "廿一"],
  ["2022-7-15", "廿二"],
  ["2022-7-16", "廿三"],
  ["2022-7-17", "廿四"],
  ["2022-7-18", "廿五"],
  ["2022-7-19", "廿六"],
  ["2022-7-20", "廿七"],
  ["2022-7-21", "廿八"],
  ["2022-7-22", "廿九"],
  ["2022-7-23", "閏六"],
  ["2022-7-24", "初二"],
  ["2022-7-25", "初三"],
  ["2022-7-26", "初四"],
  ["2022-7-27", "初五"],
  ["2022-7-28", "初六"],
  ["2022-7-29", "初七"],
  ["2022-7-30", "初八"],
  ["2022-7-31", "初九"],
  ["2022-8-1", "初十"],
  ["2022-8-2", "十一"],
  ["2022-8-3", "十二"],
  ["2022-8-4", "十三"],
  ["2022-8-5", "十四"],
  ["2022-8-6", "十五"],
  ["2022-8-7", "十六"],
  ["2022-8-8", "十七"],
  ["2022-8-9", "十八"],
  ["2022-8-10", "十九"],
  ["2022-8-11", "二十"],
  ["2022-8-12", "廿一"],
  ["2022-8-13", "廿二"],
  ["2022-8-14", "廿三"],
  ["2022-8-15", "廿四"],
  ["2022-8-16", "廿五"],
  ["2022-8-17", "廿六"],
  ["2022-8-18", "廿七"],
  ["2022-8-19", "廿八"],
  ["2022-8-20", "廿九"],
  ["2022-8-21", "三十"],
  ["2022-8-22", "七月"],
  ["2022-8-23", "初二"],
  ["2022-8-24", "初三"],
  ["2022-8-25", "初四"],
  ["2022-8-26", "初五"],
  ["2022-8-27", "初六"],
  ["2022-8-28", "初七"],
  ["2022-8-29", "初八"],
  ["2022-8-30", "初九"],
  ["2022-8-31", "初十"],
  ["2022-9-1", "十一"],
  ["2022-9-2", "十二"],
  ["2022-9-3", "十三"],
  ["2022-9-4", "十四"],
  ["2022-9-5", "十五"],
  ["2022-9-6", "十六"],
  ["2022-9-7", "十七"],
  ["2022-9-8", "十八"],
  ["2022-9-9", "十九"],
  ["2022-9-10", "二十"],
  ["2022-9-11", "廿一"],
  ["2022-9-12", "廿二"],
  ["2022-9-13", "廿三"],
  ["2022-9-14", "廿四"],
  ["2022-9-15", "廿五"],
  ["2022-9-16", "廿六"],
  ["2022-9-17", "廿七"],
  ["2022-9-18", "廿八"],
  ["2022-9-19", "廿九"],
  ["2022-9-20", "八月"],
  ["2022-9-21", "初二"],
  ["2022-9-22", "初三"],
  ["2022-9-23", "初四"],
  ["2022-9-24", "初五"],
  ["2022-9-25", "初六"],
  ["2022-9-26", "初七"],
  ["2022-9-27", "初八"],
  ["2022-9-28", "初九"],
  ["2022-9-29", "初十"],
  ["2022-9-30", "十一"],
  ["2022-10-1", "十二"],
  ["2022-10-2", "十三"],
  ["2022-10-3", "十四"],
  ["2022-10-4", "十五"],
  ["2022-10-5", "十六"],
  ["2022-10-6", "十七"],
  ["2022-10-7", "十八"],
  ["2022-10-8", "十九"],
  ["2022-10-9", "二十"],
  ["2022-10-10", "廿一"],
  ["2022-10-11", "廿二"],
  ["2022-10-12", "廿三"],
  ["2022-10-13", "廿四"],
  ["2022-10-14", "廿五"],
  ["2022-10-15", "廿六"],
  ["2022-10-16", "廿七"],
  ["2022-10-17", "廿八"],
  ["2022-10-18", "廿九"],
  ["2022-10-19", "三十"],
  ["2022-10-20", "九月"],
  ["2022-10-21", "初二"],
  ["2022-10-22", "初三"],
  ["2022-10-23", "初四"],
  ["2022-10-24", "初五"],
  ["2022-10-25", "初六"],
  ["2022-10-26", "初七"],
  ["2022-10-27", "初八"],
  ["2022-10-28", "初九"],
  ["2022-10-29", "初十"],
  ["2022-10-30", "十一"],
  ["2022-10-31", "十二"],
  ["2022-11-1", "十三"],
  ["2022-11-2", "十四"],
  ["2022-11-3", "十五"],
  ["2022-11-4", "十六"],
  ["2022-11-5", "十七"],
  ["2022-11-6", "十八"],
  ["2022-11-7", "十九"],
  ["2022-11-8", "二十"],
  ["2022-11-9", "廿一"],
  ["2022-11-10", "廿二"],
  ["2022-11-11", "廿三"],
  ["2022-11-12", "廿四"],
  ["2022-11-13", "廿五"],
  ["2022-11-14", "廿六"],
  ["2022-11-15", "廿七"],
  ["2022-11-16", "廿八"],
  ["2022-11-17", "廿九"],
  ["2022-11-18", "十月"],
  ["2022-11-19", "初二"],
  ["2022-11-20", "初三"],
  ["2022-11-21", "初四"],
  ["2022-11-22", "初五"],
  ["2022-11-23", "初六"],
  ["2022-11-24", "初七"],
  ["2022-11-25", "初八"],
  ["2022-11-26", "初九"],
  ["2022-11-27", "初十"],
  ["2022-11-28", "十一"],
  ["2022-11-29", "十二"],
  ["2022-11-30", "十三"],
  ["2022-12-1", "十四"],
  ["2022-12-2", "十五"],
  ["2022-12-3", "十六"],
  ["2022-12-4", "十七"],
  ["2022-12-5", "十八"],
  ["2022-12-6", "十九"],
  ["2022-12-7", "二十"],
  ["2022-12-8", "廿一"],
  ["2022-12-9", "廿二"],
  ["2022-12-10", "廿三"],
  ["2022-12-11", "廿四"],
  ["2022-12-12", "廿五"],
  ["2022-12-13", "廿六"],
  ["2022-12-14", "廿七"],
  ["2022-12-15", "廿八"],
  ["2022-12-16", "廿九"],
  ["2022-12-17", "三十"],
  ["2022-12-18", "十一月"],
  ["2022-12-19", "初二"],
  ["2022-12-20", "初三"],
  ["2022-12-21", "初四"],
  ["2022-12-22", "初五"],
  ["2022-12-23", "初六"],
  ["2022-12-24", "初七"],
  ["2022-12-25", "初八"],
  ["2022-12-26", "初九"],
  ["2022-12-27", "初十"],
  ["2022-12-28", "十一"],
  ["2022-12-29", "十二"],
  ["2022-12-30", "十三"],
  ["2022-12-31", "十四"],
];
</script>

<style scoped>
.home__card {
  min-height: 70vh;
}

.home__card-title {
  margin-left: -20px;
  margin-bottom: 20px;
  font-size: 16px;
  font-weight: 700;
  color: #202a34;
  text-align: left;
}

.home__card-title:before {
  content: "";
  width: 24px;
  height: 16px;
  border-left: 3px solid #0081ff;
  margin-right: 20px;
}

.home__card-mini-title {
  display: flex;
  justify-content: space-around;
  align-items: center;
  margin-bottom: 10px;
}

.home__card-mini-ctx {
  margin: 5px;
}

.home__card-mini-ctx ::v-deep .el-card__body {
  display: flex;
  justify-content: space-between;
  align-items: center;
}

.home__card-desc {
  display: flex;
  flex-direction: column;
  align-items: flex-start;
}

.home__card-icon-container {
  font-size: 40px;
}

.home__card-mini-title {
  color: rgba(0, 0, 0, 0.45);
  font-size: 16px;
}

.home__card-mini-count {
  margin-top: 5px;
  color: rgba(0, 0, 0);
}
</style>
